[AWCCostFixW_MCMScreen]
ModName=技能交互修复
PageTitle=技能交互修复/Ability Interaction Fixes

GroupHeader[0]=多重击杀触发机制修复

FIX_SERIAL_TRIGGER_Label=修复[连环杀戮]触发机制
FIX_SERIAL_TRIGGER_Tip=原本[连环杀戮]只能在[速射]、[连环射击]、[放逐]的首次击杀时触发。该修复让[连环杀戮]能被所有具备多重射击能力的击杀触发。

FIX_DEATHFROMABOVE_TRIGGER_Label=修复[死神天降]触发机制
FIX_DEATHFROMABOVE_TRIGGER_Tip=原本[死神天降]只能在[速射]、[连环射击]、[放逐]的首次击杀时触发。该修复让[死神天降]能被所有具备多重射击能力的击杀触发。

GroupHeader[1]=奖励行动点修复
FIX_REAPER_MOMENTUM_Label=修复[死神]与[气势]/[格挡]交互
FIX_REAPER_MOMENTUM_Tip=根据设计[死神]状态会完全禁用[气势]，大概为阻止[死神]每次攻击时触发[气势]产生双重/冲刺行动。该修复让[死神]奖励行动点可用于[格挡]以及其他所有动作。也让圣殿骑士在[撕裂]后总是可以[格挡]。死神：技能名，非职业名。

FIX_IMPLACABLE_CONSUMPTION_Label=修复[难以平息]额外移动点浪费
FIX_IMPLACABLE_CONSUMPTION_Tip=避免用[非回合结束动作]或[其他能力奖励行动点]击杀时，浪费[难以平息]奖励移动点。该修复让[难以平息]触发后可用[非移动动作]。难以平息：击杀后可移动。

GroupHeader[2]=杂项修复
FIX_COMBATPROTOCOL_ROBOTIC_Label=修复[战争协议]额外伤害
FIX_COMBATPROTOCOL_ROBOTIC_Tip=如同大多数单体伤害技能，[战争协议]可攻击被你控制或侵入的敌方单位。但如没有该修复，则无法将对机械敌人的额外伤害应用于此类单位。
FIX_ARCWAVE_Label=恢复[电弧波]的[撕裂]跳跃攻击动画
FIX_ARCWAVE_Tip=一旦圣殿骑士获得[电弧波]，移动攻击的[撕裂]就会失去精美的跳跃动画，该修复将还原其跳跃动画。
FIX_ANNIHILATE_Label=修复[歼灭]触发机制
FIX_ANNIHILATE_Tip=原本[歼灭]只有在[放逐]射击实际造成击杀时才触发。但如果击杀是由于其他原因造成(如[追踪地雷]或爆炸连带伤害)，或者当前目标没被击杀却无法继续被瞄准(如进入[静滞]或由于地板损坏而跌出视线)。该修复让[歼灭]可继续攻击下个目标。